doc/td/td_specificite_c++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Spécificités du C++</title>
<!-- 2013-10-19 sam. 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="td_pointeur_fonction.html">Compilation, pointeur & références </a><a href="td_specificite_c++.html">Spécificités du C++ </a><a href="td_classes.html">Classes en C++ </a><aa>Fraction de nombres complexes </aa><aa>Constructeur & destructeurs </aa><aa>Surcharge d'opérateur </aa><aa>Polymorphisme & classe abstraite </aa><a href="td_blackjack.html">Jeu du blackjack </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Spécificités du C++</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Suite de Fibonacci : le calcul numérique appliqué à la procréation des lapins</h2>
<div class="outline-text-2" id="text-1">
<p>
La suite de Fibonacci est une suite d&rsquo;entiers devant son nom au mathématicien
italien du XIII<sup>ème</sup> siècle Leonardo Fibonacci qui, dans un problème
récréatif posé dans un de ses ouvrages, le <i>Liber Abaci</i>, décrit la croissance
d&rsquo;une population de lapins en ces termes
</p>

<blockquote>
<p>
<i>Un homme met un couple de lapins dans un lieu isolé de tous les côtés par un</i>
<i>mur. Combien de couples obtient-on en un an si chaque couple engendre tous les</i>
<i>mois un nouveau couple à compter du troisième mois de son existence ?</i>
</p>
</blockquote>

<p>
Ce problème est à l&rsquo;origine de la suite dont le \(n\)<sup>ième</sup> terme
correspond au nombre de paires de lapins au \(n\)<sup>ième</sup> mois. En
notant \(\mathcal{F}_n\) le nombre de couples de lapin au début du mois
\(n\) et en posant \(\mathcal{F}_1=\mathcal{F}_2=1\), Fibonacci déduit
ainsi la relation de récurrence suivante :
</p>
<p>
à savoir que le nombre de couples de lapin au mois \(n\) est égal à la
somme des couples de lapins lors des deux moins précédents.
</p>

<ul class="org-ul">
<li>Écrire une fonction calculant le nombre de Fibonacci au \(n\)<sup>ième</sup> terme. Par
défaut, cette fonction fournira le nombre de Fibonacci pour \(n=10\). En outre,
vous déclarerez deux fonctions <code>fibonacci</code> prenant comme argument
respectivement un entier court non signé <code>unsigned short</code> et un entier non
signé <code>unsigned int</code>. Tester l&rsquo;appel de chacune des fonctions suivant le type
d&rsquo;argument fourni.
</li>

<li>Au sein du programme principal, réaliser \(N\gg1\) fois le calcul de la fonction
de Fibonacci et estimer le temps d&rsquo;exécution nécessaire au programme <i>via</i> la
commande unix <code>time ./nom_executable</code>.
</li>

<li>Modifier les précédentes fonctions afin de les rendre &ldquo;en ligne&rdquo;. Comparer et
commenter le temps d&rsquo;exécution dans ce mode par rapport aux précédentes
déclarations.
</li>

<li>Concevoir et implémenter une fonction <code>rfibonacci</code> proposant une solution
récursive au calcul de la suite de Fibonacci. À partir de cette fonction,
déduire une macro équivalente, l&rsquo;implémenter et expliquer le résultat de la
compilation. Rendre la fonction <code>rfibonacci</code> &ldquo;en ligne&rdquo;, compiler et, sachant
que la notion de fonction en ligne est équivalente à la définition de macro du
point de vue du remplacement littéral des expressions, interpréter le fait
que le compilateur permette l&rsquo;exécution du programme.
</li>

<li>Insérer la fonction récursive <code>rfibonacci</code>, renommée en <code>fibonacci</code>, dans deux
fichiers distincts : un premier fichier d&rsquo;en-tête nommé <code>fibonacci.hh</code>
comprenant la déclaration (prototype) de la fonction et un second,
<code>fibonacci.cc</code>, définissant cette fonction. Modifier le programme principal
afin d&rsquo;utiliser cette fonction (on commentera provisoirement la précédente
fonction <code>fibonacci</code>), compiler et tester l&rsquo;exécution.
</li>

<li>Finalement, décommenter la version &ldquo;locale&rdquo; de <code>fibonacci</code> <i>i.e.</i> celle
contenue dans le programme principal et définie au début de cette
exercice. Chercher à résoudre l&rsquo;erreur de compilation en utilisant un espace
de nom <code>local</code> et tester le programme en forçant le choix de fonction à
utiliser <i>via</i> l&rsquo;opérateur de portée <code>local::</code>.
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
